-- phpMyAdmin SQL Dump
-- version 4.7.0
-- https://www.phpmyadmin.net/
--
-- Máy chủ: 127.0.0.1
-- Thời gian đã tạo: Th6 08, 2017 lúc 08:34 PM
-- Phiên bản máy phục vụ: 10.1.22-MariaDB
-- Phiên bản PHP: 7.1.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Cơ sở dữ liệu: `restaurant`
--

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `chi_tiet_phieu_nhap`
--

CREATE TABLE `chi_tiet_phieu_nhap` (
  `MaPNH` int(10) UNSIGNED NOT NULL,
  `MaNL` int(10) UNSIGNED NOT NULL,
  `SoLuongNhap` float UNSIGNED DEFAULT NULL,
  `GiaNhap` float UNSIGNED DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `chi_tiet_phieu_nhap`
--

INSERT INTO `chi_tiet_phieu_nhap` (`MaPNH`, `MaNL`, `SoLuongNhap`, `GiaNhap`) VALUES
(3, 2, 1, 50000),
(3, 31, 1, 6000),
(4, 4, 5, 15000),
(4, 5, 4, 20000),
(4, 6, 4, 60000),
(4, 31, 1, 0),
(5, 6, 4, 99999),
(5, 7, 4, 88888),
(8, 2, 8, 100000),
(8, 31, 8, 50000),
(9, 2, 4, 50000),
(9, 4, 2, 10000),
(9, 5, 4, 15000),
(9, 31, 5, 10000),
(10, 2, 10, 20000),
(10, 31, 10, 10000),
(11, 31, 40, 10000),
(12, 4, 20, 20000),
(12, 5, 20, 30000),
(13, 13, 100, 9000),
(13, 14, 100, 15000),
(13, 15, 100, 10000),
(14, 5, 100, 20000),
(14, 6, 100, 50000),
(15, 2, 50, 40000),
(15, 3, 50, 50000),
(16, 12, 200, 10000),
(16, 15, 200, 10000),
(17, 4, 50, 58000),
(17, 5, 50, 54000),
(18, 7, 50, 33000),
(18, 8, 50, 30000),
(18, 9, 50, 28000),
(19, 6, 50, 100000),
(19, 10, 50, 60000),
(19, 11, 50, 180000),
(20, 16, 144, 15000),
(20, 13, 144, 15000),
(21, 18, 96, 5000),
(21, 19, 96, 5000),
(21, 20, 96, 4000),
(21, 21, 96, 4000),
(22, 18, 168, 5000),
(22, 20, 168, 4000),
(23, 22, 624, 4000),
(24, 23, 80, 19000),
(24, 24, 60, 12000),
(24, 27, 30, 9000),
(24, 28, 40, 7500),
(25, 32, 60, 6000),
(25, 33, 85, 9000),
(25, 25, 100, 1000),
(25, 26, 70, 35000),
(26, 32, 60, 6000),
(26, 33, 85, 9000),
(26, 25, 100, 1000),
(26, 26, 70, 35000),
(27, 34, 50, 120000),
(27, 36, 30, 25000),
(27, 38, 45, 80000),
(27, 29, 100, 100000),
(28, 35, 50, 1000),
(28, 37, 100, 6000),
(28, 39, 20, 2000),
(28, 42, 100, 2000),
(29, 60, 30, 400000),
(29, 61, 40, 600000),
(29, 62, 80, 700000),
(30, 48, 70, 50000),
(30, 49, 150, 25000),
(30, 51, 60, 2000),
(30, 38, 80, 80000),
(31, 40, 50, 40000),
(31, 41, 60, 50000),
(31, 43, 100, 60000),
(31, 44, 70, 50000),
(32, 53, 100, 2000),
(32, 56, 250, 5000),
(32, 26, 90, 50000),
(32, 59, 100, 15000),
(33, 2, 100, 40000),
(33, 3, 150, 50000),
(33, 26, 200, 50000),
(34, 52, 200, 7000),
(34, 57, 140, 8000),
(34, 58, 80, 20000),
(34, 47, 100, 10000),
(35, 6, 10, 300000),
(35, 7, 80, 30000),
(35, 8, 80, 70000),
(35, 9, 30, 40000),
(36, 16, 48, 15000),
(36, 17, 48, 15000),
(36, 12, 48, 15000),
(36, 13, 48, 15000),
(36, 14, 48, 15000),
(36, 15, 48, 15000);

--
-- Chỉ mục cho các bảng đã đổ
--

--
-- Chỉ mục cho bảng `chi_tiet_phieu_nhap`
--
ALTER TABLE `chi_tiet_phieu_nhap`
  ADD PRIMARY KEY (`MaPNH`,`MaNL`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
